GAME_NAME = "DURAK"

WIN = "ПОБЕДА!!!"

HEARTS_SUIT = "♥️"
DIAMONDS_SUIT = "♦️"
CLUBS_SUIT = "♣️"
SPADES_SUIT = "♠️"

# Errors:

ERRORS = {
    1 : "Ход несколькими картами возможен только если эти карты имеют одинаковую силу",
    2 : "Невозможно сходить этой картой , так как равной ей по силе нет на поле",
    3 : "Карты, которыми ходят одновременно должны иметь одинаковую силу",
    4 : "У игрока не хватит карт чтобы покрыться",
    5 : "Невозможно покрыть. Карта имеет меньшую силу"
}


KARDS_SET = {
    HEARTS_SUIT: {
        6: "|♥️|\n|6|",
        7: "|♥️|\n|7|",
        8: "|♥️|\n|8|",
        9: "|♥️|\n|9|",
        10: "|♥️|\n|10|",
        11: "|♥️|\n|J|",
        12: "|♥️|\n|Q|",
        13: "|♥️|\n|K|",
        14: "|♥️|\n|A|",
    },
    DIAMONDS_SUIT: {
        6: "|♦️|\n|6|",
        7: "|♦️|\n|7|",
        8: "|♦️|\n|8|",
        9: "|♦️|\n|9|",
        10: "|♦️|\n|10|",
        11: "|♦️|\n|J|",
        12: "|♦️|\n|Q|",
        13: "|♦️|\n|K|",
        14: "|♦️|\n|A|",
    },
    CLUBS_SUIT: {
        6: "|♣️|\n|6|",
        7: "|♣️|\n|7|",
        8: "|♣️|\n|8|",
        9: "|♣️|\n|9|",
        10: "|♣️|\n|10|",
        11: "|♣️|\n|J|",
        12: "|♣️|\n|Q|",
        13: "|♣️|\n|K|",
        14: "|♣️|\n|A|",
    },
    SPADES_SUIT: {
        6: "|♠️|\n|6|",
        7: "|♠️|\n|7|",
        8: "|♠️|\n|8|",
        9: "|♠️|\n|9|",
        10: "|♠️|\n|10|",
        11: "|♠️|\n|J|",
        12: "|♠️|\n|Q|",
        13: "|♠️|\n|K|",
        14: "|♠️|\n|A|",
    },
}

BIG_KARDS_SET = {
    HEARTS_SUIT: {
        6: "|♥️|\n|6|",
        7: "|♥️|\n|7|",
        8: "|♥️|\n|8|",
        9: "|♥️|\n|9|",
        10: "|♥️|\n|10|",
        11: "|♥️|\n|J|",
        12: "|♥️|\n|Q|",
        13: "|♥️|\n|K|",
        14: "|♥️|\n|A|",
    },
    DIAMONDS_SUIT: {
        6: "|♦️|\n|6|",
        7: "|♦️|\n|7|",
        8: "|♦️|\n|8|",
        9: "|♦️|\n|9|",
        10: "|♦️|\n|10|",
        11: "|♦️|\n|J|",
        12: "|♦️|\n|Q|",
        13: "|♦️|\n|K|",
        14: "|♦️|\n|A|",
    },
    CLUBS_SUIT: {
        6: "|♣️|\n|6|",
        7: "|♣️|\n|7|",
        8: "|♣️|\n|8|",
        9: "|♣️|\n|9|",
        10: "|♣️|\n|10|",
        11: "|♣️|\n|J|",
        12: "|♣️|\n|Q|",
        13: "|♣️|\n|K|",
        14: "|♣️|\n|A|",
    },
    SPADES_SUIT: {
        6: "|♠️|\n|6|",
        7: "|♠️|\n|7|",
        8: "|♠️|\n|8|",
        9: "|♠️|\n|9|",
        10: "|♠️|\n|10|",
        11: "|♠️|\n|J|",
        12: "|♠️|\n|Q|",
        13: "|♠️|\n|K|",
        14: "|♠️|\n|A|",
    },
}




